Revit 2026 API

# FailureMessageKey Operators

---

The FailureMessageKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equality(FailureMessageKey, FailureMessageKey) | Determines whether two FailureMessageKeys are the same. |
|  | Inequality(FailureMessageKey, FailureMessageKey) | Determines whether two FailureMessageKeys are different. |

#### Reference

FailureMessageKey Class

Autodesk.Revit.DB Namespace